### CHAPTER 7
# Data Cleaning and Preparation

In [141]:
import pandas as pd
import numpy as np

In [142]:
float_data = pd.Series([1.2, -3.5, np.nan, 0])
float_data

0    1.2
1   -3.5
2    NaN
3    0.0
dtype: float64

In [143]:
float_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [144]:
string_data = pd.Series(["aardvark", np.nan, None, "avocado"])
string_data

0    aardvark
1         NaN
2        None
3     avocado
dtype: object

In [145]:
string_data.isnull()

0    False
1     True
2     True
3    False
dtype: bool

In [146]:
float_data = pd.Series([1, 2, None], dtype='float64')
float_data

0    1.0
1    2.0
2    NaN
dtype: float64

In [147]:
float_data.isnull()

0    False
1    False
2     True
dtype: bool

In [148]:
data = pd.Series([1, np.nan, 3.5, np.nan, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [149]:
data[data.notna()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [150]:
data = pd.DataFrame([[1., 6.5, 3.], [1., np.nan, np.nan],
                     [np.nan, np.nan, np.nan], [np.nan, 6.5, 3.]])
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [151]:
data.dropna()  # Drops any row with NaN values

     0    1    2
0  1.0  6.5  3.0

In [152]:
data.dropna(how='all')  # Drops any row with all NaN values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [153]:
data[4] = np.nan
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [154]:
data.dropna(axis="columns", how='all')  # Drops any column with all NaN values

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [155]:
df = pd.DataFrame(np.random.standard_normal((7, 3)))
df

          0         1         2
0  0.016351 -0.653821  0.385265
1  0.483702 -1.374746  0.471089
2 -1.307528 -1.812316 -0.105358
3  0.589127 -0.093186 -0.864033
4  1.174936  0.575517  1.621170
5  0.451614  0.571623  0.339865
6 -0.143403  0.006979  0.370215

In [156]:
df.iloc[:4, 1] = np.nan
df.iloc[:2, 2] = np.nan
df

          0         1         2
0  0.016351       NaN       NaN
1  0.483702       NaN       NaN
2 -1.307528       NaN -0.105358
3  0.589127       NaN -0.864033
4  1.174936  0.575517  1.621170
5  0.451614  0.571623  0.339865
6 -0.143403  0.006979  0.370215

In [157]:
df.dropna()

          0         1         2
4  1.174936  0.575517  1.621170
5  0.451614  0.571623  0.339865
6 -0.143403  0.006979  0.370215

In [158]:
df.dropna(thresh=2)  # Keep only rows with at least 2 non-NaN values

          0         1         2
2 -1.307528       NaN -0.105358
3  0.589127       NaN -0.864033
4  1.174936  0.575517  1.621170
5  0.451614  0.571623  0.339865
6 -0.143403  0.006979  0.370215

### Filling In Missing Data

In [159]:
df.fillna(0)  # Fill NaN values with 0

          0         1         2
0  0.016351  0.000000  0.000000
1  0.483702  0.000000  0.000000
2 -1.307528  0.000000 -0.105358
3  0.589127  0.000000 -0.864033
4  1.174936  0.575517  1.621170
5  0.451614  0.571623  0.339865
6 -0.143403  0.006979  0.370215

In [160]:
df.fillna({1:0.5, 2:0})  # Fill NaN values in column 1 with 0.5 and column 2 with 0

          0         1         2
0  0.016351  0.500000  0.000000
1  0.483702  0.500000  0.000000
2 -1.307528  0.500000 -0.105358
3  0.589127  0.500000 -0.864033
4  1.174936  0.575517  1.621170
5  0.451614  0.571623  0.339865
6 -0.143403  0.006979  0.370215

In [161]:
df = pd.DataFrame(np.random.standard_normal((6, 3)))
df.iloc[2:, 1] = np.nan
df.iloc[4:, 2] = np.nan
df

          0         1         2
0  0.762520 -0.641175 -0.091870
1 -0.254027  0.453458  0.640768
2  0.483467       NaN -1.919905
3 -0.344777       NaN -0.788941
4 -0.238732       NaN       NaN
5  1.093657       NaN       NaN

In [162]:
df.fillna(method='ffill')  # Forward fill NaN values

C:\Users\sahor\AppData\Local\Temp\ipykernel_2796\2883871002.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill')  # Forward fill NaN values

          0         1         2
0  0.762520 -0.641175 -0.091870
1 -0.254027  0.453458  0.640768
2  0.483467  0.453458 -1.919905
3 -0.344777  0.453458 -0.788941
4 -0.238732  0.453458 -0.788941
5  1.093657  0.453458 -0.788941

In [163]:
df.fillna(method='ffill', limit=2)  # Forward fill NaN values with a limit of 2

C:\Users\sahor\AppData\Local\Temp\ipykernel_2796\3537515366.py:1: FutureWarning: DataFrame.fillna with 'method' is deprecated and will raise in a future version. Use obj.ffill() or obj.bfill() instead.
  df.fillna(method='ffill', limit=2)  # Forward fill NaN values with a limit of 2

          0         1         2
0  0.762520 -0.641175 -0.091870
1 -0.254027  0.453458  0.640768
2  0.483467  0.453458 -1.919905
3 -0.344777  0.453458 -0.788941
4 -0.238732       NaN -0.788941
5  1.093657       NaN -0.788941

In [164]:
data = pd.Series([1., np.nan, 3.5, np.nan, 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [165]:
data.fillna(data.mean())  # Fill NaN values with the mean of the Series

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 7.2 Data Transformation

### Removing Duplicates

In [166]:
data = pd.DataFrame({"k1": ["one", "two"] * 3 + ["two"],
                     "k2": [1, 1, 2, 3, 3, 4, 4]})
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [167]:
data.duplicated()  # Check for duplicate rows

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [168]:
data.drop_duplicates()  # Drop duplicate rows

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [169]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [170]:
data["v1"] = range(7)
data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [171]:
data.drop_duplicates(subset=["k1"])  # Drop duplicates based on column 'k1'

    k1  k2  v1
0  one   1   0
1  two   1   1

In [172]:
data.drop_duplicates(["k1", "k2"], keep="last")  # Drop duplicates based on columns 'k1' and 'k2'

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data Using a Function or Mapping

In [173]:
data = pd.DataFrame({"food": ["bacon", "pulled pork", "bacon",
                              "pastrami", "corned beef", "bacon",
                              "pastrami", "honey ham", "nova lox"],
                     "ounces": [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     pastrami     6.0
4  corned beef     7.5
5        bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [174]:
meat_to_animal = {
 "bacon": "pig",
 "pulled pork": "pig",
 "pastrami": "cow",
 "corned beef": "cow",
 "honey ham": "pig",
 "nova lox": "salmon"
}
data["animal"] = data["food"].map(meat_to_animal)
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     pastrami     6.0     cow
4  corned beef     7.5     cow
5        bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [175]:
def get_animal(x):
    return meat_to_animal[x]
data["food"].map(get_animal)

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

In [176]:
data =pd.Series([1., -999., 2., -999., -1000., 3.])
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [177]:
data.replace(-999, np.nan)  # Replace -999 with NaN

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [178]:
data.replace([-999, -1000], np.nan)  # Replace -999 and -1000 with NaN

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [179]:
data.replace([-999, -1000], [np.nan, 0])  # Replace -999 with NaN and -1000 with 0

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [180]:
data.replace({-999:np.nan, -1000:0})  # Replace -999 with NaN and -1000 with 0 using a dictionary

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [181]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

### Renaming Axis Indexes

In [182]:
data = pd.DataFrame(np.arange(12).reshape(3, 4), 
                    index=["Ohio", "Colorado", "New York"],
                    columns=["one", "two", "three", "four"])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [183]:
def transform(x):
    return x[:4].upper()
data.index = data.index.map(transform)

In [184]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [185]:
data.rename(index=str.title, columns=str.upper)  # Rename index and columns with functions

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [186]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [187]:
data.rename(index={"OHIO": "INDIANA"}, columns={"three": "peekaboo"})  # Rename specific index and column labels

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [188]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

### Discretization and Binning

In [191]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]
bins = [18, 25, 35, 60, 100]

In [192]:
age_categories = pd.cut(ages, bins)
age_categories

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64, right]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [193]:
age_categories.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [194]:
age_categories.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]], dtype='interval[int64, right]')

In [195]:
age_categories.categories[0]

Interval(18, 25, closed='right')

In [196]:
pd.value_counts(age_categories)

C:\Users\sahor\AppData\Local\Temp\ipykernel_2796\3010498523.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(age_categories)

(18, 25]     5
(25, 35]     3
(35, 60]     3
(60, 100]    1
Name: count, dtype: int64

In [197]:
pd.cut(ages, bins, right=False)  # Left-inclusive bins

[[18, 25), [18, 25), [25, 35), [25, 35), [18, 25), ..., [25, 35), [60, 100), [35, 60), [35, 60), [25, 35)]
Length: 12
Categories (4, interval[int64, left]): [[18, 25) < [25, 35) < [35, 60) < [60, 100)]

In [199]:
group_names = ["Youth", "YoungAdult", "MiddleAged", "Senior"]
pd.cut(ages, bins, labels=group_names)  # Use custom labels for the bins

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [201]:
data = np.random.uniform(size=20)
pd.cut(data, 4, precision=2)  # Cut into 4 equal-width bins with 2 decimal places

[(0.73, 0.97], (0.73, 0.97], (0.022, 0.26], (0.73, 0.97], (0.022, 0.26], ..., (0.73, 0.97], (0.73, 0.97], (0.73, 0.97], (0.022, 0.26], (0.73, 0.97]]
Length: 20
Categories (4, interval[float64, right]): [(0.022, 0.26] < (0.26, 0.49] < (0.49, 0.73] < (0.73, 0.97]]

In [202]:
data = np.random.standard_normal(1000)
quartiles = pd.qcut(data, 4, precision=2)  # Cut into 4 equal-size bins with 2 decimal places
quartiles

[(-3.6799999999999997, -0.69], (-0.69, -0.039], (-0.039, 0.64], (0.64, 2.96], (-0.69, -0.039], ..., (-0.69, -0.039], (0.64, 2.96], (-0.039, 0.64], (-0.039, 0.64], (0.64, 2.96]]
Length: 1000
Categories (4, interval[float64, right]): [(-3.6799999999999997, -0.69] < (-0.69, -0.039] < (-0.039, 0.64] < (0.64, 2.96]]

In [203]:
pd.value_counts(quartiles)

C:\Users\sahor\AppData\Local\Temp\ipykernel_2796\3472704981.py:1: FutureWarning: pandas.value_counts is deprecated and will be removed in a future version. Use pd.Series(obj).value_counts() instead.
  pd.value_counts(quartiles)

(-3.6799999999999997, -0.69]    250
(-0.69, -0.039]                 250
(-0.039, 0.64]                  250
(0.64, 2.96]                    250
Name: count, dtype: int64

In [204]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.0]).value_counts()

(-3.675, -1.363]     100
(-1.363, -0.0391]    400
(-0.0391, 1.212]     400
(1.212, 2.958]       100
Name: count, dtype: int64

### Detecting and Filtering Outliers

In [207]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.005407    -0.036876    -0.028301     0.027159
std       0.982552     0.992036     0.984783     1.060297
min      -2.684985    -2.710173    -3.058509    -3.336157
25%      -0.711733    -0.706104    -0.725766    -0.707811
50%      -0.028374    -0.068946    -0.018791    -0.000245
75%       0.708843     0.610116     0.634540     0.768658
max       2.928988     3.133456     3.202658     3.136914

In [209]:
col = data[2]
col[col.abs() > 3]

252    3.128634
358    3.202658
524   -3.058509
662   -3.012578
772   -3.008397
812    3.057988
Name: 2, dtype: float64

In [210]:
data[(data.abs() > 3).any(axis="columns")]

            0         1         2         3
252  0.153358  1.665219  3.128634  0.554440
253 -0.918731  0.603479 -2.023369 -3.309451
351 -0.873453  0.556478 -0.167931  3.136914
358 -2.628666 -1.519966  3.202658  0.911934
524  0.381832  0.436981 -3.058509 -0.599990
662  0.445584 -0.272367 -3.012578  0.866008
772  0.131184  0.140806 -3.008397 -0.777758
811  1.419934  0.709608  0.023281 -3.336157
812 -0.355851 -1.506009  3.057988  1.807285
834  0.132715  3.133456 -0.841853  1.035943

In [211]:
data[data.abs() > 3] = np.sign(data) * 3
data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean     -0.005407    -0.037009    -0.028611     0.027667
std       0.982552     0.991618     0.983310     1.057958
min      -2.684985    -2.710173    -3.000000    -3.000000
25%      -0.711733    -0.706104    -0.725766    -0.707811
50%      -0.028374    -0.068946    -0.018791    -0.000245
75%       0.708843     0.610116     0.634540     0.768658
max       2.928988     3.000000     3.000000     3.000000

In [212]:
np.sign(data).head()

     0    1    2    3
0  1.0  1.0 -1.0  1.0
1  1.0 -1.0  1.0  1.0
2  1.0  1.0 -1.0  1.0
3  1.0 -1.0  1.0 -1.0
4  1.0 -1.0 -1.0  1.0